import {Vacancy} from '../types/vacancy';
import {ExpectedExperience} from '../const';

export const Vacancies: Vacancy[] = [
  {
    'id': 1,
    'name': 'SEO',
    'description': 'Если вы заинтересованы в работе со стабильным высоким доходом, который зависит от вас, а также профессиональным ростом, то дочитайте эту вакансию до конца. Если же вам нужна работа ради работы, то просьба перейти к просмотру других предложений.Если вы заинтересованы в работе со стабильным высоким доходом, который зависит от вас, а также совсем другим профессиональным ростом, то дочитайте эту вакансию до конца. Если же вам нужна работа ради работы, то...',
    'expected_experience': ExpectedExperience.NO_EXPERIENCE,
    'department': {
      'id': 1,
      'name': 'SEO',
      'description': 'В этом отделе проводятся маркетинговые исследования, которые необходимы для понимания и анализа жизнеспособности компании. Они изучают окружающую среду, здесь ценят потребителей, их покупательские привычки, вкусы и т. Д. А также ресурсы и конкуренты, с которыми они могут столкнуться на рынке, на котором вы работаете.',
      'leader': {
        'id': 3,
        'surname': 'Перов',
        'name': 'Дмитрий',
        'patronymic': 'Валерьевич'
      }
    },
    'published_at': null
  },
  {
    'id': 50,
    'name': 'SEO',
    'description': 'Если вы заинтересованы в работе со стабильным высоким доходом, который зависит от вас, а также профессиональным ростом, то дочитайте эту вакансию до конца. Если же вам нужна работа ради работы, то просьба перейти к просмотру других предложений.Если вы заинтересованы в работе со стабильным высоким доходом, который зависит от вас, а также совсем другим профессиональным ростом, то дочитайте эту вакансию до конца. Если же вам нужна работа ради работы, то...',
    'expected_experience': ExpectedExperience.FROM_ONE_TO_THREE_YEARS,
    'salary_to': 5999,
    'department': {
      'id': 2,
      'name': 'SEO',
      'description': 'В этом отделе проводятся маркетинговые исследования, которые необходимы для понимания и анализа жизнеспособности компании. Они изучают окружающую среду, здесь ценят потребителей, их покупательские привычки, вкусы и т. Д. А также ресурсы и конкуренты, с которыми они могут столкнуться на рынке, на котором вы работаете.',
      'leader': {
        'id': 32,
        'surname': 'Перов',
        'name': 'Дмитрий',
        'patronymic': 'Валерьевич'
      }
    },
    'published_at': null
  },
  {
    'id': 7,
    'name': 'SEO',
    'description': 'Если вы заинтересованы в работе со стабильным высоким доходом, который зависит от вас, а также профессиональным ростом, то дочитайте эту вакансию до конца. Если же вам нужна работа ради работы, то просьба перейти к просмотру других предложений.Если вы заинтересованы в работе со стабильным высоким доходом, который зависит от вас, а также совсем другим профессиональным ростом, то дочитайте эту вакансию до конца. Если же вам нужна работа ради работы, то...',
    'expected_experience': ExpectedExperience.NO_EXPERIENCE,
    'salary_from': 4000,
    'salary_to': 5999,
    'department': {
      'id': 4,
      'name': 'SEO',
      'leader': {
        'id': 34,
        'surname': 'Перов',
        'name': 'Дмитрий',
        'patronymic': 'Валерьевич'
      }
    },
    'published_at': null
  },
  {
    'id': 5546,
    'name': 'SEO',
    'description': 'Если вы заинтересованы в работе со стабильным высоким доходом, который зависит от вас, а также профессиональным ростом, то дочитайте эту вакансию до конца. Если же вам нужна работа ради работы, то просьба перейти к просмотру других предложений.Если вы заинтересованы в работе со стабильным высоким доходом, который зависит от вас, а также совсем другим профессиональным ростом, то дочитайте эту вакансию до конца. Если же вам нужна работа ради работы, то...',
    'expected_experience': ExpectedExperience.FROM_ONE_TO_THREE_YEARS,
    'department': {
      'id': 15,
      'name': 'SEO',
      'leader': {
        'id': 35,
        'surname': 'Перов',
        'name': 'Дмитрий',
        'patronymic': 'Валерьевич'
      }
    },
    'published_at': null
  },
  {
    'id': 453,
    'name': 'SEO',
    'description': 'Если вы заинтересованы в работе со стабильным высоким доходом, который зависит от вас, а также профессиональным ростом, то дочитайте эту вакансию до конца. Если же вам нужна работа ради работы, то просьба перейти к просмотру других предложений.Если вы заинтересованы в работе со стабильным высоким доходом, который зависит от вас, а также совсем другим профессиональным ростом, то дочитайте эту вакансию до конца. Если же вам нужна работа ради работы, то...',
    'expected_experience': ExpectedExperience.NO_EXPERIENCE,
    'salary_from': 4000,
    'salary_to': 5999,
    'department': {
      'id': 17,
      'name': 'SEO',
      'leader': {
        'id': 37,
        'surname': 'Перов',
        'name': 'Дмитрий',
        'patronymic': 'Валерьевич'
      }
    },
    'published_at': null
  },
  {
    'id': 85,
    'name': 'SEO',
    'description': 'Если вы заинтересованы в работе со стабильным высоким доходом, который зависит от вас, а также профессиональным ростом, то дочитайте эту вакансию до конца. Если же вам нужна работа ради работы, то просьба перейти к просмотру других предложений.Если вы заинтересованы в работе со стабильным высоким доходом, который зависит от вас, а также совсем другим профессиональным ростом, то дочитайте эту вакансию до конца. Если же вам нужна работа ради работы, то...',
    'expected_experience': ExpectedExperience.NO_EXPERIENCE,
    'salary_from': 4000,
    'salary_to': 5999,
    'department': {
      'id': 18,
      'name': 'SEO',
      'leader': {
        'id': 38,
        'surname': 'Перов',
        'name': 'Дмитрий',
        'patronymic': 'Валерьевич'
      }
    },
    'published_at': null
  },
  {
    'id': 565,
    'name': 'SEO',
    'description': 'Если вы заинтересованы в работе со стабильным высоким доходом, который зависит от вас, а также профессиональным ростом, то дочитайте эту вакансию до конца. Если же вам нужна работа ради работы, то просьба перейти к просмотру других предложений.Если вы заинтересованы в работе со стабильным высоким доходом, который зависит от вас, а также совсем другим профессиональным ростом, то дочитайте эту вакансию до конца. Если же вам нужна работа ради работы, то...',
    'expected_experience': ExpectedExperience.NO_EXPERIENCE,
    'salary_from': 4000,
    'salary_to': 5999,
    'department': {
      'id': 91,
      'name': 'SEO',
      'leader': {
        'id': 43,
        'surname': 'Перов',
        'name': 'Дмитрий',
        'patronymic': 'Валерьевич'
      }
    },
    'published_at': null
  },
];
